1. Creating dataframes: Create a DataFrame with three columns: 'Name', 'Age', and 'Score'. Populate it with random data with five
individuals.
2. Indexing and slicing: Set the 'Name' column as the index of the DataFrame created in exercise 1. Then, slice the DataFrame to
display information about individuals with ages greater than 25.
3. Data type conversion: Convert the data type of the 'Score' column to float in the DataFrame created in exercise 1.
4. Grouping and aggregation: Group the DataFrame from exercise 1 by the 'Age' column and calculate the mean score for each
age group. (ensure there is at least 2 Ages that are the same in this dataset)

In [86]:
import pandas as pd

# 1. Creating dataframes: Create a DataFrame with three columns: 'Name', 'Age', and 'Score'. Populate it with random data with five
# individuals.
df = pd.DataFrame({
    'Name': ["jacob", "ahmad", "robin", "mohammad", "ali", "sara"],
    'Age': [41, 35, 20, 25, 20, 45],
    'Score': [7, 9, 10, 6, 20 , 20]
})

df = df.set_index('Name')

ages = df[df['Age'] > 25]

df['Score'] = df['Score'].astype(float)

# This line groups the DataFrame 'df' by the 'Age' column and calculates the mean of the remaining columns (here, 'Score') for each age group.
# The result is a new DataFrame 'aged' where the index is the unique ages, and the values are the average scores for each age.
aged = df.groupby('Age').mean()

print(aged)

     Score
Age
20    15.0
25     6.0
35     9.0
41     7.0
45    20.0

In [40]:
# 5. Handling missing data: Introduce some missing values (NaN) in the 'Score' column of the DataFrame from exercise 3. Use the
# fillna() function to fill these missing values with the mean score

df['Score'] = df['Score'].fillna(df['Score'].mean())
print(df)

          Age  Score
Name
jacob      41    7.0
ahmad      35    9.0
robin      20   10.0
mohammad   25    6.0
ali        20    8.0
sara       45    8.0

In [ ]:
# 6. Concatenation: Create another DataFrame with three columns: 'Name', 'Age', and 'Occupation' for five different individuals. Use
# concat() to concatenate this new DataFrame with the one from exercise 1.

import pandas as pd

# Create a DataFrame with 3 columns
df1 = pd.DataFrame({
    'Name': ["jacob", "ahmad", "robin", "mohammad", "ali", "sara"],
    'Age': [41, 35, 20, 25, 20, 45],
    'Occupation': ["Engineer", "Doctor", "Artist", "Teacher", "Student", "Nurse"]
})

df1 = df1.set_index('Name')
print(df1)
print(df)

df_concat = pd.concat([df, df1], axis=1)

df_concat

          Age Occupation
Name
jacob      41   Engineer
ahmad      35     Doctor
robin      20     Artist
mohammad   25    Teacher
ali        20    Student
sara       45      Nurse
          Age  Score
Name
jacob      41    7.0
ahmad      35    9.0
robin      20   10.0
mohammad   25    6.0
ali        20    8.0
sara       45    8.0

          Age  Score  Age Occupation
Name
jacob      41    7.0   41   Engineer
ahmad      35    9.0   35     Doctor
robin      20   10.0   20     Artist
mohammad   25    6.0   25    Teacher
ali        20    8.0   20    Student
sara       45    8.0   45      Nurse

Merging: Create two DataFrames, one with 'ID', 'Name', and 'Age', and the other with 'ID', 'Occupation', and 'Salary'. Use merge()
to merge these DataFrames based on the 'ID' column

In [ ]:

df = pd.DataFrame({
    'ID': [1, 2, 3, 4, 5 , 6],
    'Name': ["jacob", "ahmad", "robin", "mohammad", "ali", "sara"],
    'Age': [41, 35, 20, 25, 20, 45],
    })

df1 = pd.DataFrame({
    'ID': [1, 2, 3, 4, 5 , 6],
    'Salary': [41000, 35000, 20000, 25000, 20000, 45000],
    'Occupation': ["Engineer", "Doctor", "Artist", "Teacher", "Student", "Nurse"]
})


merge = pd.merge(df, df1)

merge = merge.set_index('ID')

print(merge)

        Name  Age  Salary Occupation
ID
1      jacob   41   41000   Engineer
2      ahmad   35   35000     Doctor
3      robin   20   20000     Artist
4   mohammad   25   25000    Teacher
5        ali   20   20000    Student
6       sara   45   45000      Nurse

In [71]:
import pandas as pd

#Creating a DataFrame manually
data = {
    'user_id': [101, 102, 103, 104, None],
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'email': ['alice@example.com', 'bob@example.com', None, 'david@example.com', 'eve@example.com'],
    'signup_date': ['2023-01-01', '2023-02-15', '2023-03-22', '2023-04-10', ''],
    'purchase_amount': ['250.0', '300.5', 'not available', '150.75', '400.0']
}
df = pd.DataFrame(data)

df['signup_date'] = df['signup_date'].astype('datetime64[ns]')

dtyoe = df['signup_date'].dtypes 

print(dtyoe)

datetime64[ns]

In [70]:
dtyoe = df['signup_date'].dtypes 

print(dtyoe)

datetime64[ns]

In [77]:
df.rename(columns={'signup_date': 'Event_date', 'purchase_amount': 'Real_amount'}, inplace=True)

df

   user_id     name              email Event_date    Real_amount
0    101.0    Alice  alice@example.com 2023-01-01          250.0
1    102.0      Bob    bob@example.com 2023-02-15          300.5
2    103.0  Charlie               None 2023-03-22  not available
3    104.0    David  david@example.com 2023-04-10         150.75
4      NaN      Eve    eve@example.com        NaT          400.0

In [80]:
df1 = pd.DataFrame({
    'Name': ["jacob", "ahmad", "robin", "mohammad", "ali", "sara"],
    'Age': [41, 35, 20, 25, 20, 20],
    'Occupation': ["Engineer", "Doctor", "Artist", "Teacher", "Student", "Nurse"]
})
df1 = df1['Age'].unique()
df1 = pd.DataFrame(df1, columns=['Age'])
df1

   Age
0   41
1   35
2   20
3   25

In [95]:
import pandas as pd 

df = pd.read_csv('titanic.csv')

df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [96]:
df.columns = df.columns.str.replace(r'[^A-Za-z0-9_]', '', regex=True)

df.head()

,Survived,Pclass,Name,Sex,Age,SiblingsSpousesAboard,ParentsChildrenAboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [97]:
df

,Survived,Pclass,Name,Sex,Age,SiblingsSpousesAboard,ParentsChildrenAboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...,...
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.0000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000
884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.4500
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.7500

In [99]:
df.loc[df['Age'] < 18, 'Sex'] = 'child'

df

,Survived,Pclass,Name,Sex,Age,SiblingsSpousesAboard,ParentsChildrenAboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...,...
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.0000
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.0000
884,0,3,Miss. Catherine Helen Johnston,child,7.0,1,2,23.4500
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.0000
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.7500

In [ ]:
neew = df.groupby('Sex')['Fare'].mean()
print(neew)

Sex
child     31.057823
female    47.388364
male      25.144094
Name: Fare, dtype: float64

In [116]:
neew = df.groupby(['Sex' , 'Pclass'])['Fare'].mean()

print(neew)

Sex     Pclass
child   1         108.079858
        2          25.963226
        3          22.562153
female  1         106.315794
        2          21.169206
        3          13.826651
male    1          65.570304
        2          19.070704
        3          10.775798
Name: Fare, dtype: float64

In [117]:
avg = df.groupby('Survived')['Fare'].mean()

print(avg)

Survived
0    22.208584
1    48.395408
Name: Fare, dtype: float64